In [1]:
import pandas as pd

In [4]:
# 读取csv文件，使用默认的标题行，逗号
fpath = "./data/movies/ratings.csv"
ratings = pd.read_csv(fpath)
# 查看前几行
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
# 查看数据的形状,返回（行数，列数）
ratings.shape

(100836, 4)

In [6]:
# 查看列明列表
ratings.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [8]:
ratings.index

RangeIndex(start=0, stop=100836, step=1)

In [9]:
# 查看每列的数据类型
ratings.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

In [18]:
# 读取txt
tPath ="./data/movies/u.user"
user=pd.read_csv(tPath,sep="|",header=None,names=['number','age','sex','职业','工号'])

In [19]:
user

     number  age sex             职业     工号
0         1   24   M     technician  85711
1         2   53   F          other  94043
2         3   23   M         writer  32067
3         4   24   M     technician  43537
4         5   33   F          other  15213
..      ...  ...  ..            ...    ...
938     939   26   F        student  33319
939     940   32   M  administrator  02215
940     941   20   M        student  97229
941     942   48   F      librarian  78209
942     943   22   M        student  77841

[943 rows x 5 columns]

In [22]:
fXls = "./data/student/student_clean.xlsx"
pd.read_excel(fXls)

   姓名  科目  分数
0  小明  语文  85
1  小明  数学  80
2  小明  英语  90
3  小王  语文  85
4  小王  数学   0
5  小王  英语  90
6  小刚  语文  85
7  小刚  数学  80
8  小刚  英语  90

In [10]:
# 创建索引
series = pd.Series([1,'a',5,2.7])

In [11]:
# 获取索引
series.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
series.values

array([1, 'a', 5, 2.7], dtype=object)

In [12]:
# 自定义索引
s2 = pd.Series([1,'a',2,3],index=['d','a','c','e'])

In [13]:
s2.index

Index(['d', 'a', 'c', 'e'], dtype='object')

In [19]:
# python字典创建索引
s3Data = {"a":1,"b":2}
s3 = pd.Series(s3Data)

In [20]:
s3.index

Index(['a', 'b'], dtype='object')

In [26]:
type(series[[0,1]])

pandas.core.series.Series

In [30]:
data = {
    "state":['A','B'],
    "year":[2022,2023],
    "pop":[1.4,1.6]
}
df1 = pd.DataFrame(data)

In [32]:
df1.dtypes

state     object
year       int64
pop      float64
dtype: object

In [33]:
df1.columns

Index(['state', 'year', 'pop'], dtype='object')

In [35]:
#查询一行一列 返回的是 Series
type(df1["year"])

pandas.core.series.Series

In [38]:
#查询多行多列返回的是 DataFrame
type(df1[['year','pop']])

pandas.core.frame.DataFrame

In [52]:
df1.index

RangeIndex(start=0, stop=2, step=1)

In [53]:
df1.loc[0:df1.index.stop]

  state  year  pop
0     A  2022  1.4
1     B  2023  1.6